Revit 2027 API
TaskDialog.ExtraCheckBoxText Property
 ExtraCheckBoxText is used to label the extra checkbox.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ExtraCheckBoxText { get; set; }
Public Property ExtraCheckBoxText As String
	Get
	Set
public:
property String^ ExtraCheckBoxText {
	String^ get ();
	void set (String^ value);
}
member ExtraCheckBoxText : string with get, set
Property Value
String
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if the TaskDialog also has EnableMarqueeProgressBar set as the two cannot coincide in the same TaskDialog.
Remarks
 If ExtraCheckBoxText is set, a checkbox with the text will be shown. You can get the response of checkbox by checking the return value of the WasExtraCheckBoxChecked() method.
See Also
Reference
TaskDialog Class
Autodesk.Revit.UI Namespace